{
  "Index": {
    "title": "Hello world!",
    "description": "This is a multi-language site for a Onesight challenge.",
    "home": "Home",
    "professionalExperience": "Professional Experience"
  },
  "Header": {
    "title": "Multi-language App"
  },
  "ProfessionalExperience": {
    "title": "Professional Experience",
    "experiences": {
      "trybe": {
        "company": "Trybe",
        "position": "Frontend Web Developer",
        "employmentType": "Full-time",
        "duration": "Apr 2022 - Jun 2023",
        "responsibilities": "As part of the teams responsible for course and assessment content, I worked on making improvements, implementing new features, testing, bug fixing, and refactoring. Additionally, as a former student of Trybe, I had the opportunity to contribute to enhancing the student experience, bringing both a user perspective and a developer's viewpoint.",
        "skills": "React, Typescript, GraphQL, React Testing Library, Redux, Mantine, Github, HTML, CSS"
      },
      "jungleDevs": {
        "company": "Jungle Devs",
        "position": "Associate Software Engineering",
        "employmentType": "Full-time",
        "duration": "Oct 2021 - Apr 2022",
        "project": "Canal Digital - Woliver",
        "projectDescription": "Canal Digital is a real estate rental platform whose purpose is to reduce bureaucracy renting a property. It consists of two sites, one for the future client and the other for real estate agencies.",
        "responsibilities": "While working on Canal Digital I helped in the maintenance, improvement and to add features to the application. This is a production project following an Agile flow where we work on sprints of two weeks. The team is quite dynamic and we focus on client feedback to keep improving the features usability and performance. Lastly, this portal has many integrations with different legacy systems from the multiple agencies and it is always fundamental to make sure everyone is aligned and following good communication processes to prevent bugs from reaching production.",
        "skills": "React Native, Redux, ReactJS, AMP, Scrum, Kanban, Typescript, Javascript, ContextAPI"
      },
      "alliance": {
        "company": "Alliance Construtora",
        "position": "Civil Engineer",
        "employmentType": "Full-time",
        "duration": "Jan 2012 - Aug 2017",
        "responsibilities": "Construction supervision; verification of services; project analysis; surveying and budgeting; approving and monitoring purchase requests and orders; employee training; construction planning; labor analysis; application and monitoring of construction quality; post-delivery customer service.",
        "skills": "Microsoft Excel, Microsoft Office, AutoCAD"
      }
    }
  },
  "Education": {
    "title": "Education",
    "schools": {
      "trybe": {
        "institution": "Trybe",
        "duration": "March/2021 – March/2022",
        "degree": "Short course",
        "fieldOfStudy": "Web development (full stack)",
        "description": "1500 hour course, which encompasses the following stacks: Git, GitHub, HTML, CSS, JavaScript, React, RTL, SQL and NoSQL database, MVC, API, REST, Algorithms, Data structure, Python"
      },
      "ipog": {
        "institution": "IPOG",
        "location": "João Pessoa/Brazil",
        "duration": "2012 – 2015",
        "degree": "MBA",
        "fieldOfStudy": "Construction Management, Construction Technology and Quality",
        "description": ""
      },
      "federalUniversityOfParaiba": {
        "institution": "Federal University of Paraíba",
        "location": "João Pessoa/Brazil",
        "duration": "2007 - 2011",
        "degree": "Bachelor degree",
        "fieldOfStudy": "Civil Engineer",
        "description": ""
      }
    }
  }
}
