{
  "Index": {
    "title": "Olá mundo!",
    "description": "Esse é um site multi-idiomas para um desafio da Onesight.",
    "home": "Home",
    "professionalExperience": "Professional Experience"
  },
  "Header": {
    "title": "Página Multi-idiomas"
  },
  "ProfessionalExperience": {
    "title": "Experiência Profissional",
    "experiences": {
      "trybe": {
        "company": "Trybe",
        "position": "Desenvolvedor Web Frontend",
        "employmentType": "Tempo integral",
        "duration": "Abr 2022 - Jun 2023",
        "responsibilities": "Como parte das equipes responsáveis pelo conteúdo do curso e avaliações, trabalhei fazendo melhorias, implementando novas funcionalidades, testando, corrigindo bugs e refatorando. Além disso, como ex-aluno da Trybe, tive a oportunidade de contribuir para aprimorar a experiência do aluno, trazendo tanto uma perspectiva do usuário quanto do desenvolvedor.",
        "skills": "React, Typescript, GraphQL, React Testing Library, Redux, Mantine, Github, HTML, CSS"
      },
      "jungleDevs": {
        "company": "Jungle Devs",
        "position": "Engenheiro de Software Associado",
        "employmentType": "Tempo integral",
        "duration": "Out 2021 - Abr 2022",
        "project": "Canal Digital - Woliver",
        "projectDescription": "Canal Digital é uma plataforma de aluguel de imóveis cujo objetivo é reduzir a burocracia ao alugar um imóvel. Consiste em dois sites, um para o futuro cliente e outro para agências imobiliárias.",
        "responsibilities": "Enquanto trabalhava no Canal Digital, ajudei na manutenção, melhoria e adição de funcionalidades ao aplicativo. Este é um projeto de produção que segue um fluxo Ágil onde trabalhamos em sprints de duas semanas. A equipe é bastante dinâmica e focamos no feedback do cliente para continuar melhorando a usabilidade e o desempenho das funcionalidades. Por fim, este portal tem muitas integrações com diferentes sistemas legados das várias agências e é sempre fundamental garantir que todos estejam alinhados e seguindo bons processos de comunicação para evitar que bugs cheguem à produção.",
        "skills": "React Native, Redux, ReactJS, AMP, Scrum, Kanban, Typescript, Javascript, ContextAPI"
      },
      "alliance": {
        "company": "Alliance Construtora",
        "position": "Engenheiro Civil",
        "employmentType": "Tempo integral",
        "duration": "Jan 2012 - Ago 2017",
        "responsibilities": "Supervisão de construção; verificação de serviços; análise de projetos; levantamento e orçamento; aprovação e monitoramento de pedidos de compra e ordens; treinamento de funcionários; planejamento de construção; análise de mão de obra; aplicação e monitoramento da qualidade da construção; atendimento ao cliente pós-entrega.",
        "skills": "Microsoft Excel, Microsoft Office, AutoCAD"
      }
    }
  },
  "Education": {
    "title": "Educação",
    "schools": {
      "trybe": {
        "institution": "Trybe",
        "duration": "Março/2021 – Março/2022",
        "degree": "Curso de curta duração",
        "fieldOfStudy": "Desenvolvimento web (full stack)",
        "description": "Curso de 1500 horas, que englobam as seguintes stacks: Git, GitHub, HTML, CSS, JavaScript, React, RTL, Banco de dados SQL e NoSQL, MVC, API, REST, Algoritmos, Estrutura de dados, Python"
      },
      "ipog": {
        "institution": "IPOG",
        "location": "João Pessoa/Brasil",
        "duration": "2012 – 2015",
        "degree": "MBA",
        "fieldOfStudy": "Gestão da Construção, Tecnologia da Construção e Qualidade",
        "description": ""
      },
      "federalUniversityOfParaiba": {
        "institution": "Universidade Federal da Paraíba",
        "location": "João Pessoa/Brasil",
        "duration": "2007 - 2011",
        "degree": "Graduação",
        "fieldOfStudy": "Engenharia Civil",
        "description": ""
      }
    }
  }
}
